#### WaterType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "WaterType" from the "Water" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WaterType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WaterType ``` |

| Visual C++ |
| --- |
| ``` public enum class WaterType ``` |

# Members

| Member name | Description |
| --- | --- |
| SwimmingPool |  |
| ReflectingPool |  |
| River |  |
| Lake |  |
| Ocean |  |

# See Also

Autodesk.Revit.DB.Visual Namespace